---
title: "Please, help. Acer BeTouch E110 isn't seen by adb devices"
date: 2010-12-16
forum: General Help
---

### Post by ru-ff on 2010-12-16
$ sudo platform-tools/adb devices 
List of devices attached 
<nothing>

I've just spent several hours googling and trying to get it worked :(


Ubuntu 10.10
USB debugging is turned on.

$ lsusb
Bus 001 Device 040: ID 0502:3212 Acer, Inc.

Played alot with /etc/udev/rules.d/*-android.rules, sudo service udev restart/reload, adb kill-server and sudo adb start-server...

Here are some of the settings I used for the rules file (one by one):

SUBSYSTEM=="usb", SYSFS{product}=="Android Phone", SYMLINK+="android_adb", MODE="0666"
SUBSYSTEM=="usb", ATTRS{idVendor}=="0502", MODE="0666"
SUBSYSTEM=="usb", ATTRS{idVendor}=="0502", ATTRS{idProduct}=="3212", MODE="0666"
ATTRS{idVendor}=="0502", ATTRS{idProduct}=="3212", MODE="0666"
ATTRS{idVendor}=="0502", ATTRS{idProduct}=="3212", MODE="0666", ENV{ACL_MANAGE}="1"

_Some info which might be useful:_
$ dmesg|tail -5
[12888.236175] usb 1-8: new high speed USB device using ehci_hcd and address 42
[12888.389921] scsi41 : usb-storage 1-8:1.0
[12889.394601] scsi 41:0:0:0: Direct-Access     Linux    File-Stor Gadget 0322 PQ: 0 ANSI: 2
[12889.397545] sd 41:0:0:0: Attached scsi generic sg2 type 0
[12889.411569] sd 41:0:0:0: [sdb] Attached SCSI removable disk

$ ls -l /dev/sdb /dev/sg2
brw-rw-rw- 1 root disk  8, 16 2010-12-16 18:52 /dev/sdb
crw-rw-rw- 1 root disk 21,  2 2010-12-16 18:52 /dev/sg2

$ ls -l /dev/bus/usb/001/043 
crw-rw-r-- 1 root root 189, 42 2010-12-16 18:52 /dev/bus/usb/001/043

$ udevadm info --attribute-walk --name /dev/sdb

Udevadm info starts with the device specified by the devpath and then
walks up the chain of parent devices. It prints for every device
found, all possible attributes in the udev rules key format.
A rule to match, can be composed by the attributes of the device
and the attributes from one single parent device.

  looking at device '/devices/pci0000:00/0000:00:1d.7/usb1/1-8/1-8:1.0/host42/target42:0:0/42:0:0:0/block/sdb':
    KERNEL=="sdb"
    SUBSYSTEM=="block"
    DRIVER==""
    ATTR{range}=="16"
    ATTR{ext_range}=="256"
    ATTR{removable}=="1"
    ATTR{ro}=="0"
    ATTR{size}=="0"
    ATTR{alignment_offset}=="0"
    ATTR{discard_alignment}=="0"
    ATTR{capability}=="51"
    ATTR{stat}=="       0        0        0        0        0        0        0        0        0        0        0"
    ATTR{inflight}=="       0        0"

  looking at parent device '/devices/pci0000:00/0000:00:1d.7/usb1/1-8/1-8:1.0/host42/target42:0:0/42:0:0:0':
    KERNELS=="42:0:0:0"
    SUBSYSTEMS=="scsi"
    DRIVERS=="sd"
    ATTRS{device_blocked}=="0"
    ATTRS{type}=="0"
    ATTRS{scsi_level}=="3"
    ATTRS{vendor}=="Linux   "
    ATTRS{model}=="File-Stor Gadget"
    ATTRS{rev}=="0322"
    ATTRS{state}=="running"
    ATTRS{timeout}=="30"
    ATTRS{iocounterbits}=="32"
    ATTRS{iorequest_cnt}=="0x2e7"
    ATTRS{iodone_cnt}=="0x2e7"
    ATTRS{ioerr_cnt}=="0x215"
    ATTRS{modalias}=="scsi:t-0x00"
    ATTRS{evt_media_change}=="0"
    ATTRS{dh_state}=="detached"
    ATTRS{queue_depth}=="1"
    ATTRS{queue_type}=="none"
    ATTRS{max_sectors}=="240"

  looking at parent device '/devices/pci0000:00/0000:00:1d.7/usb1/1-8/1-8:1.0/host42/target42:0:0':
    KERNELS=="target42:0:0"
    SUBSYSTEMS=="scsi"
    DRIVERS==""

  looking at parent device '/devices/pci0000:00/0000:00:1d.7/usb1/1-8/1-8:1.0/host42':
    KERNELS=="host42"
    SUBSYSTEMS=="scsi"
    DRIVERS==""

  looking at parent device '/devices/pci0000:00/0000:00:1d.7/usb1/1-8/1-8:1.0':
    KERNELS=="1-8:1.0"
    SUBSYSTEMS=="usb"
    DRIVERS=="usb-storage"
    ATTRS{bInterfaceNumber}=="00"
    ATTRS{bAlternateSetting}==" 0"
    ATTRS{bNumEndpoints}=="02"
    ATTRS{bInterfaceClass}=="08"
    ATTRS{bInterfaceSubClass}=="06"
    ATTRS{bInterfaceProtocol}=="50"
    ATTRS{modalias}=="usb:v0502p3212d0322dc00dsc00dp00ic08isc06ip50"
    ATTRS{supports_autosuspend}=="0"
    ATTRS{interface}=="Mass Storage"

  looking at parent device '/devices/pci0000:00/0000:00:1d.7/usb1/1-8':
    KERNELS=="1-8"
    SUBSYSTEMS=="usb"
    DRIVERS=="usb"
    ATTRS{configuration}=="Self-powered"
    ATTRS{bNumInterfaces}==" 1"
    ATTRS{bConfigurationValue}=="1"
    ATTRS{bmAttributes}=="c0"
    ATTRS{bMaxPower}=="500mA"
    ATTRS{urbnum}=="3100"
    ATTRS{idVendor}=="0502"
    ATTRS{idProduct}=="3212"
    ATTRS{bcdDevice}=="0322"
    ATTRS{bDeviceClass}=="00"
    ATTRS{bDeviceSubClass}=="00"
    ATTRS{bDeviceProtocol}=="00"
    ATTRS{bNumConfigurations}=="1"
    ATTRS{bMaxPacketSize0}=="64"
    ATTRS{speed}=="480"
    ATTRS{busnum}=="1"
    ATTRS{devnum}=="43"
    ATTRS{devpath}=="8"
    ATTRS{version}==" 2.00"
    ATTRS{maxchild}=="0"
    ATTRS{quirks}=="0x0"
    ATTRS{avoid_reset_quirk}=="0"
    ATTRS{authorized}=="1"
    ATTRS{manufacturer}=="Linux 2.6.27-nxp with pnx67xx_ehci_udc"
    ATTRS{product}=="File-backed Storage Gadget"
    ATTRS{serial}=="3230204E6F76"

  looking at parent device '/devices/pci0000:00/0000:00:1d.7/usb1':
    KERNELS=="usb1"
    SUBSYSTEMS=="usb"
    DRIVERS=="usb"
    ATTRS{configuration}==""
    ATTRS{bNumInterfaces}==" 1"
    ATTRS{bConfigurationValue}=="1"
    ATTRS{bmAttributes}=="e0"
    ATTRS{bMaxPower}=="  0mA"
    ATTRS{urbnum}=="969"
    ATTRS{idVendor}=="1d6b"
    ATTRS{idProduct}=="0002"
    ATTRS{bcdDevice}=="0206"
    ATTRS{bDeviceClass}=="09"
    ATTRS{bDeviceSubClass}=="00"
    ATTRS{bDeviceProtocol}=="00"
    ATTRS{bNumConfigurations}=="1"
    ATTRS{bMaxPacketSize0}=="64"
    ATTRS{speed}=="480"
    ATTRS{busnum}=="1"
    ATTRS{devnum}=="1"
    ATTRS{devpath}=="0"
    ATTRS{version}==" 2.00"
    ATTRS{maxchild}=="8"
    ATTRS{quirks}=="0x0"
    ATTRS{avoid_reset_quirk}=="0"
    ATTRS{authorized}=="1"
    ATTRS{manufacturer}=="Linux 2.6.35-23-generic ehci_hcd"
    ATTRS{product}=="EHCI Host Controller"
    ATTRS{serial}=="0000:00:1d.7"
    ATTRS{authorized_default}=="1"

  looking at parent device '/devices/pci0000:00/0000:00:1d.7':
    KERNELS=="0000:00:1d.7"
    SUBSYSTEMS=="pci"
    DRIVERS=="ehci_hcd"
    ATTRS{vendor}=="0x8086"
    ATTRS{device}=="0x265c"
    ATTRS{subsystem_vendor}=="0x1025"
    ATTRS{subsystem_device}=="0x006a"
    ATTRS{class}=="0x0c0320"
    ATTRS{irq}=="23"
    ATTRS{local_cpus}=="ff"
    ATTRS{local_cpulist}=="0-7"
    ATTRS{modalias}=="pci:v00008086d0000265Csv00001025sd0000006Abc0Csc03i20"
    ATTRS{dma_mask_bits}=="32"
    ATTRS{consistent_dma_mask_bits}=="32"
    ATTRS{broken_parity_status}=="0"
    ATTRS{msi_bus}==""
    ATTRS{companion}==""

  looking at parent device '/devices/pci0000:00':
    KERNELS=="pci0000:00"
    SUBSYSTEMS==""
    DRIVERS==""

**Please help!**

---

### Post by kr651129 on 2010-12-16
I have a thread about this too

If I push files via adb to my device and then start adb shell it works, but for whatever reason after I run the commands I need to and then go back to adb shell it wont find any devices

---

### Post by ru-ff on 2010-12-17
Here is a slightly different way to do it I've found after spending heaps of time.

1. Turn on USB debugging
2. Switch USB mode to sync
3. Connect your phone, it should be identified as a network interface (usbN)
4. Setup the interface as 192.168.1.2/24

Now you should be able to connect to the device:

$ platform-tools/adb connect 192.168.1.1
* daemon not running. starting it now on port 5037 *
* daemon started successfully *
connected to 192.168.1.1:5555

$ platform-tools/adb devices
List of devices attached 
192.168.1.1:5555	device

However, it didn't help me because it turned out that I need root privileges on the device to be able to install applications through adb.

---

